{
  "name": "Glossary2",
  "description": "Generated from glossary2.csv",
  "searchContext": "Networking",
  "cards": [
    {
      "term": "What is A record?",
      "definition": "In DNS an Address (A) record maps a domain name to its IPv4 address"
    },
    {
      "term": "What is Acknowledgement number?",
      "definition": "In TCP the acknowledgement number specifies the next expected sequence number"
    },
    {
      "term": "What is Ad-Hoc network?",
      "definition": "A decentralized wireless network where nodes communicate peer-to-peer without fixed infrastructure"
    },
    {
      "term": "What is Address class system?",
      "definition": "A historical IPv4 division into classes A'96E providing fixed-size network and host portions"
    },
    {
      "term": "What is Address Resolution Protocol (ARP)?",
      "definition": "A protocol resolving IPv4 addresses to MAC addresses on a local network"
    },
    {
      "term": "What is an example of a non-metered connection?",
      "definition": "A broadband link without data caps or per-byte charges"
    },
    {
      "term": "What is Non-routable address space?",
      "definition": "IP ranges reserved for private networks (e.g. 10.0.0.0/8"
    },
    {
      "term": "What is Anycast?",
      "definition": "A routing method assigning the same IP to multiple hosts and delivering packets to the nearest one"
    },
    {
      "term": "What is Application layer?",
      "definition": "The top layer in the TCP/IP model where end-user services and protocols (HTTP"
    },
    {
      "term": "What is Application layer payload?",
      "definition": "The actual data generated by application-layer protocols"
    },
    {
      "term": "What is ARP table?",
      "definition": "A cache of IPv4-to-MAC address mappings maintained by a host or router"
    },
    {
      "term": "What is ASN?",
      "definition": "Autonomous System Number'97unique identifier for a network in BGP routing"
    },
    {
      "term": "What is Asymmetric Digital Subscriber Line (ADSL)?",
      "definition": "A DSL technology offering higher download than upload speeds over telephone lines"
    },
    {
      "term": "What is Baud rate?",
      "definition": "The number of signal changes or symbols transmitted per second in a communication channel"
    },
    {
      "term": "What is Bit?",
      "definition": "The basic unit of binary data"
    },
    {
      "term": "What is Bluetooth?",
      "definition": "A short-range wireless technology standard for exchanging data over the 2.4 GHz ISM band"
    },
    {
      "term": "What is Border Gateway Protocol (BGP)?",
      "definition": "The routing protocol that manages how packets are routed across the internet through AS-to-AS paths"
    },
    {
      "term": "What is Broadband?",
      "definition": "A high-capacity transmission technique for carrying multiple signals over wide frequency bands"
    },
    {
      "term": "What is Broadcast?",
      "definition": "A message sent from one sender to all possible receivers within a network segment"
    },
    {
      "term": "What is Broadcast address?",
      "definition": "An IP address (e.g. x.x.x.255 in IPv4) used to send a packet to all hosts on a subnet"
    },
    {
      "term": "What is Cable categories?",
      "definition": "Standards defining twisted-pair Ethernet cable performance (e.g. Cat5e"
    },
    {
      "term": "What is Cable modem?",
      "definition": "A device that modulates and demodulates data over cable TV infrastructure for internet access"
    },
    {
      "term": "What is Cable modem termination system?",
      "definition": "A headend device that communicates with multiple cable modems in a DOCSIS network"
    },
    {
      "term": "What is Cables?",
      "definition": "Physical media (copper or fiber) used to transmit data signals between network devices"
    },
    {
      "term": "What is cables use pulses of light to represent the ones and zeros of the underlying data?",
      "definition": "Fiber optic cables transmit data as light pulses through glass or plastic fibers"
    },
    {
      "term": "What is FIN?",
      "definition": "In TCP the FIN flag signals that the sender has finished sending data and wants to gracefully close the connection"
    },
    {
      "term": "What is Caching and recursive name servers?",
      "definition": "DNS servers that both store previous query results (caching) and act as intermediaries that fetch the correct IP address for the requested domain name"
    },
    {
      "term": "What is Carrier-Sense Multiple Access with Collision Detection (CSMA/CD)?",
      "definition": "An Ethernet access method where a device listens before sending and stops/transmits a jam signal if it detects a collision"
    },
    {
      "term": "What is Channels?",
      "definition": "Distinct frequency bands or time slots over which data is transmitted in parallel or multiplexed communication systems"
    },
    {
      "term": "What is CLOSE?",
      "definition": "In TCP'92s state machine"
    },
    {
      "term": "What is Cloud computing?",
      "definition": "Delivery of computing resources (servers"
    },
    {
      "term": "What is CNAME?",
      "definition": "In DNS"
    },
    {
      "term": "What is Collision domain?",
      "definition": "A network segment where simultaneous transmissions by two devices can collide and must be detected/handled (e.g."
    },
    {
      "term": "What is Computer networking?",
      "definition": "The practice and study of connecting computers and devices to share resources and exchange data"
    },
    {
      "term": "What is Connection-oriented protocol?",
      "definition": "A communications protocol (e.g. TCP) that establishes a session and ensures reliable delivery in order"
    },
    {
      "term": "What is Connectionless protocol?",
      "definition": "A protocol (e.g. UDP) that sends datagrams without establishing a prior connection or guaranteeing delivery/order"
    },
    {
      "term": "What is Copper cable categories?",
      "definition": "Standards (e.g. Cat5e"
    },
    {
      "term": "What is Crosstalk?",
      "definition": "Interference caused by signal leakage between adjacent wires or cable pairs"
    },
    {
      "term": "What is customers to run their servicesPoint-To-Point VPN?",
      "definition": "A VPN model that provides a direct"
    },
    {
      "term": "What is Cyclical Redundancy Check (CRC)?",
      "definition": "An error-detection code appended to frames or packets that lets receivers detect accidental changes in raw data"
    },
    {
      "term": "What is Data packet?",
      "definition": "A formatted unit of data carried by a packet-switched network"
    },
    {
      "term": "What is Data payload section?",
      "definition": "The portion of a packet"
    },
    {
      "term": "What is Datalink layer?",
      "definition": "Layer 2 of the OSI model responsible for node-to-node data transfer"
    },
    {
      "term": "What is Demarcate?",
      "definition": "To define or mark the boundary between two domains or systems (e.g. where customer equipment hands off to provider network)"
    },
    {
      "term": "What is Demarcation point?",
      "definition": "The physical point where a network provider'92s responsibility ends and the customer'92s begins (e.g. NID at a building)"
    },
    {
      "term": "What is Demultiplexing?",
      "definition": "The process of separating multiple multiplexed data streams back into their original"
    },
    {
      "term": "What is Destination MAC address?",
      "definition": "The hardware address in an Ethernet frame header indicating which NIC should accept and process the frame"
    },
    {
      "term": "What is Destination network?",
      "definition": "In IP routing"
    },
    {
      "term": "What is Destination port?",
      "definition": "In TCP/UDP headers"
    },
    {
      "term": "What is DHCP?",
      "definition": "Dynamic Host Configuration Protocol that automatically assigns IP addresses and network settings to devices"
    },
    {
      "term": "What is DHCP discovery?",
      "definition": "The initial broadcast message a DHCP client sends to locate available DHCP servers on the network"
    },
    {
      "term": "What is Dial-up?",
      "definition": "A network connection over an analog telephone line using a modem to convert digital signals to/from audio tones"
    },
    {
      "term": "What is discard it and perform a full resolution again?",
      "definition": "When a DNS resolver receives a truncated or invalid response"
    },
    {
      "term": "What is Twisted pair cable?",
      "definition": "Copper cabling with pairs of wires twisted together to reduce electromagnetic interference and crosstalk"
    },
    {
      "term": "What is DNS zones?",
      "definition": "Portions of the DNS namespace for which a single organization is responsible"
    },
    {
      "term": "What is Domain?",
      "definition": "A contiguous namespace in DNS identified by a common suffix (e.g. '93example.com'94) and managed as a unit"
    },
    {
      "term": "What is Domain name?",
      "definition": "A human-readable label (e.g. example.com) that maps to one or more IP addresses via DNS records"
    },
    {
      "term": "What is Domain Name System (DNS)?",
      "definition": "The hierarchical"
    },
    {
      "term": "What is DSLAM?",
      "definition": "Digital Subscriber Line Access Multiplexer that aggregates multiple DSL connections and connects them to a backbone network"
    },
    {
      "term": "What is Duplex communication?",
      "definition": "Two-way data transmission; can be half-duplex (one direction at a time) or full-duplex (simultaneous both ways)"
    },
    {
      "term": "What is Dynamic allocation?",
      "definition": "Assignment of network resources (like IP addresses) on demand rather than fixed permanently"
    },
    {
      "term": "What is Dynamic IP address?",
      "definition": "An IP address assigned temporarily by DHCP or another service"
    },
    {
      "term": "What is Error detection?",
      "definition": "Techniques (e.g. checksums"
    },
    {
      "term": "What is Error recovery?",
      "definition": "Mechanisms (e.g. retransmissions in TCP) used to correct detected errors in data transmission"
    },
    {
      "term": "What is ESTABLISHED?",
      "definition": "A TCP connection state indicating that the three-way handshake is complete and data may be exchanged"
    },
    {
      "term": "What is Ethernet?",
      "definition": "A family of wired LAN technologies defined by IEEE 802.3 standards"
    },
    {
      "term": "What is Ethernet frame?",
      "definition": "A data unit at the Data Link layer containing source/destination MAC addresses"
    },
    {
      "term": "What is Exterior gateway?",
      "definition": "A router or routing protocol used to exchange routing information between different autonomous systems (e.g. BGP)"
    },
    {
      "term": "What is Fiber cable?",
      "definition": "Optical fiber media that transmits data as light pulses through thin glass or plastic strands for high-speed links"
    },
    {
      "term": "What is Firewall?",
      "definition": "A network security device or software that enforces an access control policy between networks or hosts"
    },
    {
      "term": "What is Five layer model?",
      "definition": "A networking framework dividing communication into Physical"
    },
    {
      "term": "What is Fixed allocation?",
      "definition": "Static assignment of network resources such as permanent IP addresses or preallocated bandwidth"
    },
    {
      "term": "What is Fragmentation?",
      "definition": "The process of splitting a large IP packet into smaller fragments to fit the MTU of the transmitting network"
    },
    {
      "term": "What is Frame check sequence?",
      "definition": "An error-detecting code (usually CRC) appended to the end of a frame to verify data integrity"
    },
    {
      "term": "What is Frequency band?",
      "definition": "A range of electromagnetic frequencies allocated for transmitting signals in communication systems"
    },
    {
      "term": "What is FTP?",
      "definition": "File Transfer Protocol'97a standard network protocol for transferring files between client and server over TCP"
    },
    {
      "term": "What is FTTH?",
      "definition": "Fiber to the Home'97broadband infrastructure delivering fiber-optic connections directly to subscribers'92 residences"
    },
    {
      "term": "What is FTTN?",
      "definition": "Fiber to the Node'97network architecture where fiber reaches a neighborhood node"
    },
    {
      "term": "What is FTTP?",
      "definition": "Fiber to the Premises'97generic term for fiber deployed all the way to a building or home (includes FTTH and FTTB)"
    },
    {
      "term": "What is FTTX?",
      "definition": "Collective term for '93Fiber to the X'94 configurations (FTTH"
    },
    {
      "term": "What is Full duplex?",
      "definition": "A communication mode allowing simultaneous two-way data transmission between devices"
    },
    {
      "term": "What is Half-duplex?",
      "definition": "A communication mode where data can travel in both directions but only one direction at a time"
    },
    {
      "term": "What is Handshake?",
      "definition": "A sequence of protocol exchanges between two devices to establish communication parameters before data transfer"
    },
    {
      "term": "What is HDSL?",
      "definition": "High-bit-rate Digital Subscriber Line'97a symmetric DSL technology providing equal upload and download speeds over copper"
    },
    {
      "term": "What is Hexadecimal?",
      "definition": "A base-16 numbering system using digits 0'969 and letters A'96F"
    },
    {
      "term": "What is Hub?",
      "definition": "A simple network device that connects multiple Ethernet devices and broadcasts incoming packets to all ports"
    },
    {
      "term": "What is Hybrid cloud?",
      "definition": "An IT environment that seamlessly combines on-premises infrastructure"
    },
    {
      "term": "What is Hypervisor?",
      "definition": "Software or firmware that creates and manages virtual machines by abstracting and allocating hardware resources"
    },
    {
      "term": "What is IANA?",
      "definition": "Internet Assigned Numbers Authority'97the organization responsible for coordinating global IP address allocation and protocol identifiers"
    },
    {
      "term": "What is ICMP?",
      "definition": "Internet Control Message Protocol'97used for error reporting and network diagnostics in IP networks (e.g."
    },
    {
      "term": "What is ICMP payload?",
      "definition": "The data section within an ICMP message"
    },
    {
      "term": "What is Infrastructure as a Service (IaaS)?",
      "definition": "A cloud service model providing virtualized computing resources (servers"
    },
    {
      "term": "What is Instantiation?",
      "definition": "The creation of a specific instance of an object or resource in software or service provisioning"
    },
    {
      "term": "What is Interface?",
      "definition": "A defined point of interaction between two systems"
    },
    {
      "term": "What is Interior gateway?",
      "definition": "A router or routing protocol (e.g."
    },
    {
      "term": "What is Internet Protocol (IP)?",
      "definition": "The primary protocol in the Internet Protocol Suite responsible for addressing and routing packets across networks"
    },
    {
      "term": "What is Internet Service Provider (ISP)?",
      "definition": "A company that offers individuals and organizations access to the Internet and related services"
    },
    {
      "term": "What is Internetwork?",
      "definition": "A collection of interconnected networks that communicate using a common protocol (e.g."
    },
    {
      "term": "What is IP address?",
      "definition": "A unique numerical identifier assigned to each device on a network for location and communication purposes in IP routing"
    },
    {
      "term": "What is DSL?",
      "definition": "Digital Subscriber Line'97a family of technologies transmitting digital data over telephone lines"
    },
    {
      "term": "What is IP datagram?",
      "definition": "A basic unit of data transmitted via IP"
    },
    {
      "term": "What is IP masquerading?",
      "definition": "A form of NAT that hides multiple private IPs behind a single public IP by rewriting source addresses"
    },
    {
      "term": "What is IPv6 tunnel?",
      "definition": "A mechanism that encapsulates IPv6 packets within IPv4 packets to traverse IPv4 networks"
    },
    {
      "term": "What is IPv6 tunnel brokers?",
      "definition": "Services that provide endpoint configurations and automate the setup of IPv6-over-IPv4 tunnels"
    },
    {
      "term": "What is layers that stack on top of each other?",
      "definition": "Refers to protocol layers in network models (OSI/TCP-IP) arranged hierarchically"
    },
    {
      "term": "What is Line coding?",
      "definition": "The process of converting digital data into a digital signal for transmission using schemes like NRZ or Manchester"
    },
    {
      "term": "What is Link-local unicast address?",
      "definition": "An IP address valid only within a single network segment (e.g."
    },
    {
      "term": "What is Listen?",
      "definition": "In TCP"
    },
    {
      "term": "What is Local Area Network (LAN)?",
      "definition": "A network connecting devices within a limited area (e.g."
    },
    {
      "term": "What is Loopback address?",
      "definition": "An IP address (127.0.0.1 in IPv4"
    },
    {
      "term": "What is MAC (Media Access Control) address?",
      "definition": "A unique hardware identifier for a network interface controller used at the data link layer"
    },
    {
      "term": "What is Mesh networks?",
      "definition": "Network topology where each node relays data and connects with multiple others for resilience and multiple paths"
    },
    {
      "term": "What is Metered connection?",
      "definition": "An Internet connection billed based on data usage with caps or thresholds (e.g."
    },
    {
      "term": "What is Modulation?",
      "definition": "Technique of encoding digital information onto a carrier signal by varying amplitude"
    },
    {
      "term": "What is Multicast?",
      "definition": "A communication method sending data from one sender to multiple designated receivers using group addressing"
    },
    {
      "term": "What is Multiplexing?",
      "definition": "Combining multiple signals for transmission over a single medium by dividing by time"
    },
    {
      "term": "What is MX record?",
      "definition": "A DNS record specifying the mail exchange server responsible for receiving email for a domain"
    },
    {
      "term": "What is Name resolution?",
      "definition": "The process of translating domain names into IP addresses"
    },
    {
      "term": "What is Network Address Translation (NAT)?",
      "definition": "Method of remapping one IP address space into another by modifying network address information in packet headers"
    },
    {
      "term": "What is Network layer?",
      "definition": "Layer 3 of the OSI model responsible for routing packets across networks based on logical addressing"
    },
    {
      "term": "What is Network port?",
      "definition": "A numerical identifier in TCP/UDP headers directing packets to specific processes or services on a host"
    },
    {
      "term": "What is Network switch?",
      "definition": "A data link layer device that forwards frames based on MAC addresses to the appropriate port"
    },
    {
      "term": "What is networkClient?",
      "definition": "The software or device that initiates requests to servers or services over the network"
    },
    {
      "term": "What is Next hop?",
      "definition": "The immediate router or gateway to which a packet is forwarded on its path toward its destination"
    },
    {
      "term": "What is Node?",
      "definition": "A connection point in a network'97any device (computer"
    },
    {
      "term": "What is Non-metered connection?",
      "definition": "An Internet link without data usage caps or overage charges (e.g."
    },
    {
      "term": "What is NS record?",
      "definition": "A DNS record that specifies the authoritative name servers for a domain"
    },
    {
      "term": "What is NTP servers?",
      "definition": "Network Time Protocol servers that synchronize clocks of networked devices to a precise time source"
    },
    {
      "term": "What is Octet?",
      "definition": "A group of eight bits; synonymous with '93byte'94 in networking contexts"
    },
    {
      "term": "What is Optical Network Terminator?",
      "definition": "The endpoint device in a fiber-to-the-premises network converting optical signals to electrical signals for customer equipment"
    },
    {
      "term": "What is or QoS technologies?",
      "definition": "Techniques (e.g."
    },
    {
      "term": "What is Session layer?",
      "definition": "Layer 5 of the OSI model responsible for establishing"
    },
    {
      "term": "What is OSI model?",
      "definition": "A conceptual framework of seven layers (Physical to Application) standardizing network functions and protocols"
    },
    {
      "term": "What is Pairing?",
      "definition": "The process by which two Bluetooth devices authenticate and establish a trusted link for secure communication"
    },
    {
      "term": "What is Patch panel?",
      "definition": "A hardware assembly with ports to manage and organize cable connections in a wiring rack"
    },
    {
      "term": "What is Payload?",
      "definition": "The portion of a packet or frame containing user data"
    },
    {
      "term": "What is Physical layer?",
      "definition": "Layer 1 of the OSI model defining electrical"
    },
    {
      "term": "What is Pointer resource record?",
      "definition": "A DNS record type (PTR) mapping an IP address to its canonical hostname"
    },
    {
      "term": "What is Port?",
      "definition": "A 16-bit number in TCP/UDP headers identifying specific processes or services on a host"
    },
    {
      "term": "What is Port forwarding?",
      "definition": "A firewall/router configuration forwarding incoming traffic on one port to a different internal IP/port"
    },
    {
      "term": "What is Port preservation?",
      "definition": "A NAT behavior where the original source port is retained when mapping to a public port if available"
    },
    {
      "term": "What is Preamble?",
      "definition": "A sequence of bits at the start of a frame used for synchronization between sender and receiver"
    },
    {
      "term": "What is Presentation layer?",
      "definition": "Layer 6 of the OSI model handling data formatting"
    },
    {
      "term": "What is Private cloud?",
      "definition": "A cloud environment operated solely for a single organization"
    },
    {
      "term": "What is Protocol?",
      "definition": "A set of rules defining how data is formatted"
    },
    {
      "term": "What is Proxy service?",
      "definition": "A server that forwards client requests to other servers"
    },
    {
      "term": "What is Public cloud?",
      "definition": "A cloud environment offering services to multiple customers over the internet on shared infrastructure"
    },
    {
      "term": "What is Public DNS servers?",
      "definition": "DNS resolvers operated for public use (e.g."
    },
    {
      "term": "What is Quad A (AAAA) record?",
      "definition": "A DNS record mapping a domain name to its IPv6 address"
    },
    {
      "term": "What is Receiving address?",
      "definition": "In messaging or transactions"
    },
    {
      "term": "What is Recursive name servers?",
      "definition": "DNS servers that"
    },
    {
      "term": "What is Registrar?",
      "definition": "An organization accredited to register and manage domain names under top-level domains"
    },
    {
      "term": "What is Reverse proxy?",
      "definition": "A server that sits in front of backend servers"
    },
    {
      "term": "What is Round robin?",
      "definition": "A load-balancing method that distributes requests sequentially across a pool of servers in turn"
    },
    {
      "term": "What is Router?",
      "definition": "A network device that forwards packets between different networks based on IP addresses and routing tables"
    },
    {
      "term": "What is Routing protocols?",
      "definition": "Protocols (e.g."
    },
    {
      "term": "What is see it in use today FTTB?",
      "definition": "Fiber to the Building'97broadband architecture where fiber runs to a building'92s communications room"
    },
    {
      "term": "What is SENT?",
      "definition": "In TCP"
    },
    {
      "term": "What is Sequence number?",
      "definition": "In TCP"
    },
    {
      "term": "What is Server?",
      "definition": "A computer or process that provides resources"
    },
    {
      "term": "What is Server or Service?",
      "definition": "Refers to either the physical/virtual host (server) or the network-accessible application/function (service) it provides"
    },
    {
      "term": "What is Short-range wireless network?",
      "definition": "A wireless network (e.g."
    },
    {
      "term": "What is Simplex communication?",
      "definition": "A transmission mode where data travels in only one direction from sender to receiver"
    },
    {
      "term": "What is Socket?",
      "definition": "An endpoint for network communication defined by an IP address and port number in TCP/IP applications"
    },
    {
      "term": "What is Source MAC address?",
      "definition": "The hardware address in an Ethernet frame header identifying the sending network interface"
    },
    {
      "term": "What is Source port?",
      "definition": "The port number in TCP/UDP headers identifying the sending application'92s endpoint on the source host"
    },
    {
      "term": "What is SRV record?",
      "definition": "A DNS record specifying the hostname and port number of servers for a specific service within a domain"
    },
    {
      "term": "What is Start Frame Delimiter (SFD)?",
      "definition": "A byte sequence in Ethernet frames (10101011) that marks the end of the preamble and start of the frame"
    },
    {
      "term": "What is Start of authority?",
      "definition": "The first DNS resource record (SOA) in a zone file containing administrative information about the zone"
    },
    {
      "term": "What is Static IP address?",
      "definition": "An IP address permanently assigned to a device rather than dynamically allocated by DHCP"
    },
    {
      "term": "What is Subnet mask?",
      "definition": "A 32-bit value in IPv4 that separates the network and host portions of an IP address (e.g."
    },
    {
      "term": "What is Symmetric Digital Subscriber Line (SDSL)?",
      "definition": "A DSL technology providing equal upstream and downstream speeds over copper telephone lines"
    },
    {
      "term": "What is T-Carrier technologies?",
      "definition": "A set of digital transmission systems (e.g."
    },
    {
      "term": "What is TCP checksum?",
      "definition": "A 16-bit value in TCP headers used to detect errors in the header and data of the segment"
    },
    {
      "term": "What is TCP segment?",
      "definition": "A unit of data at the Transport layer encapsulating application data with TCP headers"
    },
    {
      "term": "What is TCP window?",
      "definition": "The amount of data (in bytes) that a receiver is willing to accept before acknowledging receipt"
    },
    {
      "term": "What is Top Level Domain (TLD)?",
      "definition": "The last segment of a domain name following the final dot (e.g."
    },
    {
      "term": "What is Total hops?",
      "definition": "The count of intermediate routers a packet traverses from source to destination"
    },
    {
      "term": "What is Transmission Control Protocol (TCP)?",
      "definition": "A core transport-layer protocol providing connection-oriented"
    },
    {
      "term": "What is Transport layer?",
      "definition": "Layer 4 of the OSI and TCP/IP models responsible for end-to-end communication"
    },
    {
      "term": "What is TTL (Time To Live)?",
      "definition": "A field in IP packets that limits their lifetime by specifying the maximum number of hops before discard"
    },
    {
      "term": "What is Two-factor authentication?",
      "definition": "A security process requiring two distinct credentials (e.g."
    },
    {
      "term": "What is TXT record?",
      "definition": "A DNS record holding arbitrary text data for a domain (commonly used for SPF"
    },
    {
      "term": "What is Types of DNS servers?",
      "definition": "Categories such as recursive resolvers"
    },
    {
      "term": "What is Unicast transmission?",
      "definition": "A one-to-one communication method where packets are sent from one host directly to another"
    },
    {
      "term": "What is User Datagram Protocol (UDP)?",
      "definition": "A connectionless transport-layer protocol that sends datagrams without delivery guarantees"
    },
    {
      "term": "What is Virtual LAN (VLAN)?",
      "definition": "A logical segmentation of a physical network into separate broadcast domains via tagging (IEEE 802.1Q)"
    },
    {
      "term": "What is Virtual Private Network (VPN)?",
      "definition": "An encrypted tunnel over a public network"
    },
    {
      "term": "What is Virtualization?",
      "definition": "The creation of virtual versions of hardware resources (servers"
    },
    {
      "term": "What is VLAN header?",
      "definition": "A 4-byte 802.1Q tag inserted into Ethernet frames to indicate VLAN membership and priority"
    },
    {
      "term": "What is WAIT (generic)?",
      "definition": "A TCP state where a connection is idle"
    },
    {
      "term": "What is WAIT (TIME_WAIT)?",
      "definition": "The TCP state after connection closure"
    },
    {
      "term": "What is Wi-Fi Protected Access (WPA)?",
      "definition": "A security protocol for wireless networks that succeeded WEP and provides stronger encryption/authentication"
    },
    {
      "term": "What is Wide area network (WAN)?",
      "definition": "A network spanning large geographic distances"
    },
    {
      "term": "What is Wired Equivalent Privacy (WEP)?",
      "definition": "An early IEEE 802.11 wireless security protocol now considered insecure and largely deprecated"
    },
    {
      "term": "What is Wireless access point?",
      "definition": "A device that bridges wireless clients to a wired network by transmitting and receiving Wi-Fi signals"
    },
    {
      "term": "What is Wireless LANs (WLANs)?",
      "definition": "Local area networks that use wireless communication (e.g."
    },
    {
      "term": "What is Wireless networking?",
      "definition": "The transfer of data between devices without physical connectors"
    },
    {
      "term": "What is Zone Files?",
      "definition": "Text files on DNS servers defining the resource records (A"
    }
  ]
}